Taurus_with_Jenkins_pipeline/Twitter.yml
---
execution:
- concurrency: 10
  ramp-up: 10s
  hold-for: 2m
  #iterations: 0
  scenario: login-logoff

scenarios:
  login-logoff:
    default-address: https://twitter.com/
    think-time: 2ms
    #data-sources:
    #- path: login-data.csv
    requests:
    # GET the home page
    - url: /
      method: GET
      label: HomePage

    - url: /
      label: LoginPage
      extract-regexp:
        #RVT: <input type="hidden" name="appActionToken" value="(.*)"
        RVT: <input type="hidden" value="(.*)" name="authenticity_token">
      assert:
      - "Twitter"
        #<input type="hidden" value="d4d680d1fc698d50e7f06951fabc18655e3a27ae" name="authenticity_token">

    - url: /sessions
      method: POST
      label: DoLogin

      body:
        authenticity_token: ${RVT}
        redirect_after_login : /
        return_to_ssl: true
        scribe_log: " "
        session[password]: #enter your twitter password here
        session[username_or_email]: #enter your twitter login here
      assert:
      - # what text do you want to assert on , once you have logged in ?






services:
- module: passfail
  criteria:
  - avg-rt of DoLogin>2s for 30s, stop as failed
  - fail of DoLogin>50% for 10s,stop as failed

modules:
  reporting:
  - module: blazemeter
    report-name: Jenkins Build Login test
    dump-csv: perf_results.csv
  #jmeter:
  #  path: C:\apache-jmeter-3.0\apache-jmeter-3.0\bin
    #download-link: https://archive.apache.org/dist/jmeter/binaries/apache-jmeter-{version}.zip
  #  version: 3.0
  #  plugins:
  #  - jpgc-json=2.2
  #  - jmeter-ftp
  #  - jpgc-casutg




#reporting:
#  - module: final_stats
#  - module: console

#settings:
#  check-interval: 5s
#  default-executor: jmeter

#provisioning: local